from attackers import *
from cnn import *
from protectors import *
from dataset import get_image


if __name__ == "__main__":
    """
    1.0) получаем изображения
    1.1) получаем классы изображений (CNN)
    1.2) атакуем изображения и сравниваем с 1.1, получаем процент атакованных изображений с помощью CNN
    1.3) все атакованные изображения исправляем от искажений с 1.2 и с помощью CNN получаем процент исправленных
    """
    # !!!! кажется CNN надо обучить ... либо найти готовую
    pass
